docs/gui/pyqt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2021-09-09 Thu 22:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PyQt</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="python GUI qt" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css">
</head>
<body>
<div id="content">
<h1 class="title">PyQt</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4527258">1. Modules</a></li>
<li><a href="#orgfd3bb4d">2. Dialogs</a>
<ul>
<li><a href="#orgf4f1184">2.1. Dumb Dialogs</a></li>
<li><a href="#org4c57bbe">2.2. Standard Dialogs</a></li>
<li><a href="#orga94d71e">2.3. Smart Dialogs</a></li>
</ul>
</li>
<li><a href="#org641a118">3. Model</a>
<ul>
<li><a href="#org3585499">3.1. <code>QtCore.QModelIndex</code></a></li>
<li><a href="#orgb0fda1b">3.2. Model Classification</a></li>
<li><a href="#org1a1d73d">3.3. Built-in Models</a></li>
</ul>
</li>
<li><a href="#orgecf8344">4. Delegate</a>
<ul>
<li><a href="#orgf357f27">4.1. APIs for read-only</a></li>
<li><a href="#orgdb8fccf">4.2. APIs for editable</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4527258" class="outline-2">
<h2 id="org4527258"><span class="section-number-2">1</span> Modules</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>QtCore</code></li>
<li><code>QtWidgets</code></li>
<li><code>QtGui</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgfd3bb4d" class="outline-2">
<h2 id="orgfd3bb4d"><span class="section-number-2">2</span> Dialogs</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf4f1184" class="outline-3">
<h3 id="orgf4f1184"><span class="section-number-3">2.1</span> Dumb Dialogs</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We define a “dumb” dialog to be a dialog whose widgets are set to their initial
values by the dialog’s caller, and whose final values are obtained directly from
the widgets, again by the dialog’s caller.
</p>

<p>
Dumb dialogs are normally modal dialogs with an “accept” button (e.g., OK ) and a
“reject” button (e.g., Cancel ).
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">dialog</span> = FakeDlg<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.values_to_set, <span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> dialog.exec_<span style="color: #3a81c3;">()</span>:
    <span style="color: #3a81c3; font-weight: bold;">self</span>.values = dialog.someWidget.value<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4c57bbe" class="outline-3">
<h3 id="org4c57bbe"><span class="section-number-3">2.2</span> Standard Dialogs</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We consider a dialog to be a “standard” dialog if it initializes its widgets in
accordance with the values set through its initializer or through its methods,
and whose final values are obtained by method calls or from instance variables—not
directly from the dialog’s widgets.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">dialog</span> = FakeDlg<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.values_to_set, <span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> dialog.exec_<span style="color: #3a81c3;">()</span>:
    <span style="color: #3a81c3; font-weight: bold;">self</span>.values = dialog.get_values<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga94d71e" class="outline-3">
<h3 id="orga94d71e"><span class="section-number-3">2.3</span> Smart Dialogs</h3>
<div class="outline-text-3" id="text-2-3">
<p>
We define a “smart” dialog to be one that initializes its widgets in accordance
with data references or data structures that are passed to its initializer, and
which is capable of updating the data directly in response to user interaction.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">dialog</span> = FakeDlg<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.values_to_set, <span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">self</span>.connect<span style="color: #3a81c3;">(</span>dialog, SIGNAL<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"changed"</span><span style="color: #6c3163;">)</span>, <span style="color: #3a81c3; font-weight: bold;">self</span>.refreshSomeWidgets<span style="color: #3a81c3;">)</span>
dialog.show<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
<div id="outline-container-orgc2f8bad" class="outline-4">
<h4 id="orgc2f8bad"><span class="section-number-4">2.3.1</span> Live</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3; font-weight: bold;">self</span>.dialog <span style="color: #3a81c3; font-weight: bold;">is</span> <span style="color: #4e3163;">None</span>:
    <span style="color: #3a81c3; font-weight: bold;">self</span>.dialog = FakeDlg<span style="color: #3a81c3;">(</span>
	<span style="color: #3a81c3; font-weight: bold;">self</span>.values_to_set, <span style="color: #3a81c3; font-weight: bold;">self</span>.refreshSomeWidgets, <span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">self</span>.dialog.show<span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3; font-weight: bold;">self</span>.dialog.raise_<span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3; font-weight: bold;">self</span>.dialog.activateWindow<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org641a118" class="outline-2">
<h2 id="org641a118"><span class="section-number-2">3</span> Model</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3585499" class="outline-3">
<h3 id="org3585499"><span class="section-number-3">3.1</span> <code>QtCore.QModelIndex</code></h3>
<div class="outline-text-3" id="text-3-1">
<p>
Every data item in the model can be identified by a unique <code>QModelIndex</code>.
Each model index has three important attributes: a row, a column, and a parent.
</p>
</div>
</div>

<div id="outline-container-orgb0fda1b" class="outline-3">
<h3 id="orgb0fda1b"><span class="section-number-3">3.2</span> Model Classification</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>List(1D): Lists are just tables with a single column.</li>
<li>Table(2D)</li>
<li>Trees(Hierarchical)</li>
</ul>
</div>

<div id="outline-container-org868aa09" class="outline-4">
<h4 id="org868aa09"><span class="section-number-4">3.2.1</span> <code>QAbstractListModel</code></h4>
<div class="outline-text-4" id="text-3-2-1">
</div>
<ul class="org-ul">
<li><a id="org291bbc4"></a>APIs for read-only<br />
<div class="outline-text-5" id="text-org291bbc4">
<ul class="org-ul">
<li><code>data(index: QModelIndex, role: int)</code></li>
<li><code>rowCount(parent: QModelIndex)</code></li>
</ul>
</div>
</li>

<li><a id="orgaa461f8"></a>APIs for editable<br />
<div class="outline-text-5" id="text-orgaa461f8">
<ul class="org-ul">
<li><code>setData</code></li>
<li><code>flags</code></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgb93cf4c" class="outline-4">
<h4 id="orgb93cf4c"><span class="section-number-4">3.2.2</span> <code>QAbstractTableModel</code></h4>
<div class="outline-text-4" id="text-3-2-2">
</div>
<ul class="org-ul">
<li><a id="org48f1c4c"></a>APIs for read-only<br />
<div class="outline-text-5" id="text-org48f1c4c">
<ul class="org-ul">
<li><code>data(index: QModelIndex, role: int)</code></li>
<li><code>rowCount(parent: QModelIndex)</code></li>
<li><code>columnCount(parent: QModelIndex)</code></li>
<li><code>headerData(section: int, orientation: Qt.Orientation, role: int)</code> (recommended)</li>
</ul>
</div>
</li>

<li><a id="org553340a"></a>APIs for editable<br />
<div class="outline-text-5" id="text-org553340a">
<ul class="org-ul">
<li><p>
<code>flags(index: QModelIndex) -&gt; QtCore.Qt.ItemFlags</code>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">example</span>
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">flags</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, index<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">return</span> QtCore.Qt.ItemFlags<span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">super</span>.flags<span style="color: #6c3163;">(</span>index<span style="color: #6c3163;">)</span> | QtCore.Qt.ItemIsEditable<span style="color: #3a81c3;">)</span>
</pre>
</div></li>

<li><code>setData(index: QtCore.QModelIndex, value, role: int = Qt.EditRole) -&gt; bool</code>: is called when the user completes an edit</li>
<li><code>insertRow(row: int, parent: QModelIndex)</code></li>
<li><code>insertRows(row: int, count: int, parent: QModelIndex)</code>
<ul class="org-ul">
<li><code>beginInsertRows(parent, first, last)</code>, <code>endInsertRows(parent, first, last)</code>: <a href="https://doc.qt.io/qt-5/qabstractitemmodel.html#beginInsertRows">reference</a></li>
</ul></li>
<li><code>removeRow(row: int, parent: QModelIndex)</code></li>
<li><code>removeRows(row: int, count: int, parent: QModelIndex)</code>
<ul class="org-ul">
<li><code>beginRemoveRows</code>, <code>endRemoveRows</code></li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orgc187552"></a>Signals<br />
<div class="outline-text-5" id="text-orgc187552">
<ul class="org-ul">
<li><code>dataChanged[topleft_index, bottomright_index]</code></li>
<li><code>modelReset()</code></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5e1f58c" class="outline-4">
<h4 id="org5e1f58c"><span class="section-number-4">3.2.3</span> <code>QAbstractTreeModel</code></h4>
</div>

<div id="outline-container-org19952af" class="outline-4">
<h4 id="org19952af"><span class="section-number-4">3.2.4</span> <code>QListWidget</code>, <code>QTableWidget</code>, and <code>QTreeWidget</code></h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
are views with models and delegates aggregated inside them.
</p>
</div>
</div>

<div id="outline-container-orgda47e9b" class="outline-4">
<h4 id="orgda47e9b"><span class="section-number-4">3.2.5</span> Pure Views</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
<code>QListView</code>, <code>QTableView</code>, and <code>QTreeView</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org1a1d73d" class="outline-3">
<h3 id="org1a1d73d"><span class="section-number-3">3.3</span> Built-in Models</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><code>QStringListModel</code></li>
<li><code>QDirModel</code></li>
<li><code>QSqlTableModel</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgecf8344" class="outline-2">
<h2 id="orgecf8344"><span class="section-number-2">4</span> Delegate</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf357f27" class="outline-3">
<h3 id="orgf357f27"><span class="section-number-3">4.1</span> APIs for read-only</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><code>paint(painter, option, index)</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgdb8fccf" class="outline-3">
<h3 id="orgdb8fccf"><span class="section-number-3">4.2</span> APIs for editable</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><code>createEditor()</code></li>
<li><code>setEditorData()</code></li>
<li><code>setModelData()</code></li>
<li><code>commitAndCloseEditor()</code> (recommended if we use <code>QLineEdit</code> or <code>QTextEdit</code> for editing)</li>
<li><code>sizeHint()</code> (sometimes)</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
